const candidates = [
  // honoka
  "パン好きな",
  "ファイトする",
  "あんこが飽きた",
  "割烹着の",
  "店番中の",
  "自転車を漕ぐ",
  "あのころの",

  // eri
  "かしこかわいい",
  "合宿好きな",
  "хорошо",
  "先輩は禁止の",
  "橋を本で見た",

  // kotori
  "枕を忘れた",
  "五本指ソックス派な",
  "伝説のカリスマ",
  "保健委員の",
  "手先が器用な",
  "学年内で一番まともな",
  "おやつにしたがる",

  // umi
  "アイドルは無しな",
  "山頂をアタックする",
  "恥ずかしがり屋な",
  "高速に枕を投げる",
  "投げキッスしたがる",
  "寝つきがいい",
  "顔に出ちゃう",

  // rin
  "ラーメン好きな",
  "イエローな",
  "大丈夫にゃ",
  "ダンスゲームが得意な",
  "バネが自慢の",
  "寒い気がする",

  // maki
  "ﾅﾆｿﾚｲﾐﾜｶﾝﾅｲ",
  "ポジティブが溢れる",
  "暖炉をきれいにする",
  "知性溢れる",
  "パーティを始める",

  // nozomi
  "カードが告げる",
  "スピリチュアル",
  "たっぷり注入する",
  "わしわししたがる",
  "関西弁の",
  "神社を掃除する",

  // hanayo
  "ご飯を炊いた",
  "大盛り好きな",
  "誰かに助けてほしい",
  "スタンプを貯める",
  "伝説の伝説の伝説",
  "コンタクトにしてみた",
  "主食は白米の",

  // nico
  "襲来する",
  "バックダンサーな",
  "チラシ配りが得意な",
  "宇宙No.1",

  // chika
  "アホ毛の",
  "みかん好きな",
  "かしこい！",
  "達筆な",

  // riko
  "お断りする",
  "引っ越してきた",
  "ビオラが得意な",
  "ビームを発する",
  "おみやげとか",
  "絵画が趣味の",

  // kanan
  "ハグをせまる",
  "筋肉がいい感じな",
  "訴えようとする",
  "舟盛りを持ってきた",
  "ワカメ好きの",

  // dia
  "プリンを食べる",
  "私は断然",
  "ちゃん付けしてほしい",
  "ちゃんとした",

  // you
  "全速前進",
  "制服を着た",
  "着ぐるみの頭を外す",
  "筋トレ好きな",

  // yoshiko
  "悪いのは",
  "空間移動使いの",
  "サメ型ハンモックの",
  "契約者を募集する",

  // hanamaru
  "超未来の",
  "熱いお茶のせいな",
  "めんが苦手な",
  "語彙と知識が豊富な",

  // mari
  "2年振りに輝く",
  "アヒル口な",
  "All or nothingな",
  "ロックオンした",

  // ruby
  "お芋好きな",
  "がんばル",
  "ふんばル",
  "アメにつられる",
];

export function getRandomAnonymousName(): string {
  const min = 0;
  const max = candidates.length - 1;
  const index = Math.floor(Math.random() * (max + 1 - min)) + min;

  const prefix = candidates[index];

  return `${prefix}学園生`;
}
